[
  {
    "rowId": 1,
    "details": [
      {
        "id": 1,
        "year": 1969,
        "text": "Bearings business was founded with the imports of bearings with Koyo Seiko Co. Ltd. Japan and introduced Koyo Bearings to the Indian market."
      },
      {
        "id": 2,
        "year": 1979,
        "text": "Established Proprietary Company, Mumbai India."
      },
      {
        "id": 3,
        "year": 1983,
        "text": "Production of DPI Bearings DPI® began with the manufacturing of ball bearings at its plant in Pune, near Mumbai (West India).  The plant was established with a technical collaboration with IKS – Japan."
      },
      {
        "id": 4,
        "year": 1984,
        "text": "DPI® established a second plant in Pune, near Mumbai (West India) to enhance the ball bearing production. Later on, an additional line of TRB bear inthe same plant."
      }
    ]
  },
  {
    "rowId": 2,
    "details": [
      {
        "id": 1,
        "year": 1985,
        "text": "DPI ® established an organization to concentrate on the production of Tapered Roller Bearings and listed itself on the Mumbai Public Stock Exchange.  In the same year, an additional plant for ball bearing products was added in Navi Mumbai, (West  India)."
      },
      {
        "id": 2,
        "year": 1987,
        "text": "DPI ® Established a factory at Halol Gujurat, West India for the manufacture of Tapered Roller Bearings. The factory was established by purchasing and installing machines from the United States. The plant established DPI ® as one of the premier manufacturers of Tapered Roller Bearings In India with Supplies to Top OEM in India."
      },
      {
        "id": 3,
        "year": 1993,
        "text": "After the liberalization, conceived the strategy of international diversification. Dubai was selected due to its proximity to India."
      },
      {
        "id": 4,
        "year": 1994,
        "text": "DPI® began exporting bearings for the first time with initial exports bound for the Middle East and South American markets."
      }
    ]
  },
  {
    "rowId": 3,
    "details": [
      {
        "id": 1,
        "year": 1998,
        "text": "Awarded Largest Distributor Award in Asia by Koyo Seiko Co. Ltd. Japan."
      },
      {
        "id": 2,
        "year": 2000,
        "text": "DPI ® moved its headquarters to Jebel Ali Dubai to cater to expanding international growth."
      },
      {
        "id": 3,
        "year": 2001,
        "text": "Began  Exclusive Agency for ZWZ for India and Middle East Market from Wafangdian Bearing Group Corporation."
      },
      {
        "id": 4,
        "year": 2007,
        "text": "DPI Exports to over 50 Countries worldwide."
      }
    ]
  },
  {
    "rowId": 4,
    "details": [
      {
        "id": 1,
        "year": 2008,
        "text": "Secured Exclusive Agency from Ulpia Rulmenti Bucuresti, Romania for U.R.B. Bearings for India and Middle East Markets."
      },
      {
        "id": 2,
        "year": 2010,
        "text": "Established ZWZ Bearings India Pvt Ltd, Joint Venture Sales Company with Wafangdian Bearings Group Corporation.  This Joint Venture announcement was held at a Press Conference in Mumbai India with the Guest of Honor being His Excellency, Mr. Niu Qingbao, Consul General for the People’s Republic of China in India."
      },
      {
        "id": 3,
        "year": 2011,
        "text": "Set up Chennai Presence."
      },
      {
        "id": 4,
        "year": 2012,
        "text": "Expanded warehousing capacity."
      }
    ]
  },
  {
    "rowId": 5,
    "details": [
      {
        "id": 1,
        "year": 2013,
        "text": "Set up Gujarat Presence."
      },
      {
        "id": 2,
        "year": 2016,
        "text": "Moved office to South Mumbai."
      },
      {
        "id": 3,
        "year": 2017,
        "text": "Associated group Co appointed as Authorised Distributors of SKF Products for Major African Market."
      },
      {
        "id": 4,
        "year": 2018,
        "text": "Associated group Co appointed as Authorised Distributor of Schaeffler FAG Automotive Products in UAE."
      }
    ]
  },
  {
    "rowId": 6,
    "details": [
      {
        "id": 1,
        "year": 2019,
        "text": "Associated Group Co appointed as Authorised Distributor of Schaeffler Industrial Products in UAE."
      },
      {
        "id": 2,
        "year": 2020,
        "text": "Moved all operations online and to cloud."
      },
      {
        "id": 3,
        "year": 2021,
        "text": "First Authorised Bearing Distributor to Launch an Online Integrated Webstore in India."
      }
    ]
  }
]
