[
    {
        "heading": "HeadQuarters",
        "id": 1,
        "content": "The company was founded in 1938 in Wafangdian City. This is the heart of ZWZ production and also includes ZWZ corporate headquarters. The product types manufactured here include small size bearings for Ball Bearings, Tapered Roller Bearings, Cylindrical roller bearings and Spherical Roller bearings."
    },
    {
        "heading": "ZWZ Liaoyang Factory",
        "id": 2,
        "content": "This is spread over 770,000 Sq. Meters and established in 1970. The zone includes operations of grinding and assembly and is focussed on self aligning bearings, Ball bearings, tapered roller bearings and cylindrical roller bearings."
    },
    {
        "heading": "ZWZ-Koyo Bearing Factory",
        "id": 3,
        "content": "This is spread over 0.77M sq. Meters and established in 1996. This factory mainly produce three generations car hub bearings, most bearings are imported to Japan for TOYOTA cars."
    },
    {
        "heading": "ZWZ New Technology Park",
        "id": 4,
        "content": "This is spread over 2.75M Sq. Mt and established in 2005. The zone includes operations such as heat treatment, grinding and assembly and is focused on medium to large and extra large sized bearings. The product types manufacturer here include slewing rim bearings, Multi row cylindrical  and tapered roller bearings and high precision bearings etc."
    },
    {
        "heading": "ZWZ Dalian Industrial Zone",
        "id": 5,
        "content": "This is spread over 1.5 Million Sq. Meters and established in 2009. The zone includes operations of grinding and assembly and is focused on middle to large sized ball bearings for high precision motors."
    },
    {
        "heading": "ZWZ New Industry and Technology Park (Center City)",
        "id": 6,
        "content": "This is the biggest new industrial p0ark. ZWZ held a ground breaking ceremony on 28 September 2010. This is spread over 10.5 Sq. Km. ZWZ totally invested 1 Billion USD into this industrial park. The zone includes operations of bearings for heavy trick and high precision machines."
    }
]